---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimTextBackground
source: html/e90afed8-4f6b-57ad-f47c-875b70a3dfcf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimTextBackground Property

"Text Background"

## Syntax (C#)
```csharp
public static ForgeTypeId DimTextBackground { get; }
```